Yr7/7-CS-Turing/pages/6_Lesson.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Touring Turing</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">Touring Turing</h1>
  <div class="github-fork-ribbon-wrapper left">
    <div class="github-fork-ribbon">
      <a href="https://github.com/MarcScott/7-CS-Turing">Fork me on GitHub</a>
    </div>
  </div>
<div id="stickyribbon">
    <ul>
      <li><a href="1_Lesson.html">Week1</a></li>
      <li><a href="2_Lesson.html">Week2</a></li>
      <li><a href="3_Lesson.html">Week3</a></li>
      <li><a href="4_Lesson.html">Week4</a></li>
      <li><a href="5_Lesson.html">Week5</a></li>
      <li><a href="6_Lesson.html">Week6</a></li>
      <li><a href="7_Lesson.html">Week7</a></li>
      <li><a href="assessment.html">Assessment</a></li>

    </ul>
  </div>
<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1"><span class="section-number-2">1</span> Looping</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3 learn">
<h3 id="sec-1-1">Learn It</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>At the moment our scripts have run in one direction - <i>Top</i> to <i>Bottom</i>.
</li>
<li>Even though we've used branches (with <code>if</code>, <code>elif</code> and <code>else</code>), the branches still run from top to bottom.
</li>
<li>When Turing devised his <i>Turing Machine</i> he imagined that the machine would be able to move forwards and backwards along the tape.
</li>
<li>This would mean that the machine could end up reading the same section of tape, multiple times. This would be a loop.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3 learn">
<h3 id="sec-1-2">Learn It</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>In Python we can use what is known as a <code>while</code> loop.
</li>
<li>Thinking back to our earlier examples of deciding what to do depending upon the weather is like outside; you might say something along the lines of&#x2026;
</li>
</ul>
<blockquote>
<p>
While it is raining outside, I am staying indoor.
</p>
</blockquote>
<ul class="org-ul">
<li>In Python this would look something like;
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #859900;">while</span> raining == <span style="color: #268bd2;">True</span>:
    <span style="color: #859900;">print</span>(<span style="color: #2aa198;">'I am staying indoors'</span>)
</pre>
</div>
<ul class="org-ul">
<li>Notice that we need to use that same <code>:</code> on the end of the condition.
</li>
<li>We also need that <i>significant whitespace</i> before any code that is supposed to run <i>inside</i> the loop.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3 code">
<h3 id="sec-1-3">Code It</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Let's start by trying a version of the example above, but add a little user input into the code.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6c71c4;">raining</span> = <span style="color: #6c71c4;">input</span>(<span style="color: #2aa198;">'Is it raining outside '</span>)
<span style="color: #859900;">while</span> raining == <span style="color: #2aa198;">'yes'</span>:
    <span style="color: #859900;">print</span>(<span style="color: #2aa198;">'You had best stay indoors'</span>)
<span style="color: #859900;">print</span>(<span style="color: #2aa198;">'You can go outside'</span>)
</pre>
</div>
<ul class="org-ul">
<li>Run your code and see what happens, when you type 'no'
</li>
<li>As <code>raining</code> does not equal 'yes', the computer does not enter the while loop, so the lines are skipped to the next line with no whitespace.
</li>
<li>Run it again, and this time type 'yes'.
</li>
<li>Is there a problem?
</li>
<li>You can quit a running program by using the shortcut <code>Ctrl+c</code>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3 learn">
<h3 id="sec-1-4">Learn It</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>You've just experienced your first infinite loop.
</li>
<li>This is when a program runs and runs and never ends.
</li>
<li>The problem was that once we had set the variable <code>raining</code> to 'yes' there was no way to change it. <code>raining</code> was always going to be 'yes.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3 code">
<h3 id="sec-1-5">Code It</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>We can alter our code to allow changing of the variable though.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6c71c4;">raining</span> = <span style="color: #6c71c4;">input</span>(<span style="color: #2aa198;">'Is it raining outside '</span>)
<span style="color: #859900;">while</span> raining == <span style="color: #2aa198;">'yes'</span>:
    <span style="color: #859900;">print</span>(<span style="color: #2aa198;">'You had best stay indoors'</span>)
    <span style="color: #6c71c4;">raining</span> = <span style="color: #6c71c4;">input</span>(<span style="color: #2aa198;">'Is it raining outside '</span>)
<span style="color: #859900;">print</span>(<span style="color: #2aa198;">'You can go outside'</span>)
</pre>
</div>
<ul class="org-ul">
<li>Now run the code and see what happens.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3 learn">
<h3 id="sec-1-6">Learn It</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>We can use the same <i>Comparison Operators</i> for a <code>while</code> loop that we used for conditionals.
</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Comparison Operator</th>
<th scope="col" class="left">Description</th>
<th scope="col" class="left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">==</td>
<td class="left">Tests if two things are equal</td>
<td class="left">6 == 6 is True</td>
</tr>

<tr>
<td class="left">!=</td>
<td class="left">Tests if two things are <b>not</b> equal</td>
<td class="left">4 != 6 is True</td>
</tr>

<tr>
<td class="left">&lt;</td>
<td class="left">Tests if one thing is less than another</td>
<td class="left">3 &lt;  10 is True</td>
</tr>

<tr>
<td class="left">&gt;</td>
<td class="left">Tests if one thing is greater than another</td>
<td class="left">10 &gt; 3 is True</td>
</tr>

<tr>
<td class="left">&lt;=</td>
<td class="left">Tests if one thing is less than <b>or</b> equal to another</td>
<td class="left">10 &lt;= 10 is True and 9 &lt;= 10 is True</td>
</tr>

<tr>
<td class="left">&gt;=</td>
<td class="left">Tests if one thing is greater than <b>or</b> equal to another</td>
<td class="left">5 &gt;= 5 is True and 5 &gt;= 3 is True</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-1-7" class="outline-3 code">
<h3 id="sec-1-7">Code It</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li>We can use a <code>while</code> loop to make a password authentication program.
</li>
<li>This time we'll use the <code>=!</code> comparison (not equal to)
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6c71c4;">password</span> = <span style="color: #2aa198;">'correct horse battery staple'</span>
<span style="color: #6c71c4;">attempt</span> = <span style="color: #6c71c4;">input</span>(<span style="color: #2aa198;">'Please enter a password '</span>)
<span style="color: #859900;">while</span> attempt != password:
    <span style="color: #859900;">print</span>(<span style="color: #2aa198;">'Access denied'</span>)
    <span style="color: #6c71c4;">attempt</span> = <span style="color: #6c71c4;">input</span>(<span style="color: #2aa198;">'Please enter a password '</span>)
<span style="color: #859900;">print</span>(<span style="color: #2aa198;">'Access granted.)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-8" class="outline-3 badge">
<h3 id="sec-1-8">Badge It - Silver</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li>Try and write a script that asks the user to answer a simple sum.
</li>
<li>If they get it right, they should be congratulated
</li>
<li>If they get it wrong they should be asked the question again.
</li>
<li>Don't forget to type cast the user input.
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2 activity">
<h2 id="sec-2"><span class="section-number-2">2</span> Counting</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-sec-2-1" class="outline-3 learn">
<h3 id="sec-2-1">Learn It</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>One of the simplest tasks we can get a computer to do is to count.
</li>
<li>When you count to 100, you start at 1 and then keep adding on 1 until you get to 100.
</li>
<li>Let's code this with a <code>while</code> loop.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3 code">
<h3 id="sec-2-2">Code It</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6c71c4;">count</span> = 1
<span style="color: #859900;">while</span> count &lt;= 100:
    <span style="color: #859900;">print</span>(count)
    <span style="color: #6c71c4;">count</span> = count + 1
</pre>
</div>
<ul class="org-ul">
<li>Can you alter the code so that the computer counts to 10000
</li>
<li>Alter it so that it counts in 2s, then 10s
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3 badge">
<h3 id="sec-2-3">Badge It - Gold</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Create a while loop that counts down from 100 to 0.
</li>
<li>Create a while loop that prints out 1, and then doubles it, printing out the answer each time until it reaches 1,000,000
</li>
<li>Create a while loop that prints out <b>Computing is Grrrreat</b> a thousand times.
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2 activity">
<h2 id="sec-3"><span class="section-number-2">3</span> Singing</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-sec-3-1" class="outline-3 learn">
<h3 id="sec-3-1">Learn It</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>There are lots of counting songs that children use to learn to count:
<ul class="org-ul">
<li>5 Little Ducks went swimming one day
</li>
<li>5 Currant Buns in a baker's shop
</li>
<li>5 Little Speckled Frogs
</li>
<li>5 Little Monkeys
</li>
<li>5 Red Apples
</li>
</ul>
</li>
<li>If you don't know the lyrics, you can listen to some of them<a href="http://www.bbc.co.uk/schoolradio/subjects/mathematics/countingsongs"> here</a>.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3 code">
<h3 id="sec-3-2">Code It</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Writing out the lyrics to a simple counting song wouldn't take too long.
</li>
<li>You could probably write out the lyrics to 10 Green Bottles fairly quickly
</li>
</ul>
<iframe width="420" height="315" src="https://www.youtube.com/embed/Ak7kedzR8bg" frameborder="0" allowfullscreen></iframe>
<ul class="org-ul">
<li>But what if I asked you to write out the lyrics to 1000 green bottles.
</li>
<li>Have a look at the script below.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6c71c4;">bottles</span> = 1000
<span style="color: #859900;">while</span> bottles &gt; 0:
    <span style="color: #859900;">print</span>(<span style="color: #6c71c4;">str</span>(bottles) + <span style="color: #2aa198;">' green bottles sitting on the wall'</span>)
    <span style="color: #859900;">print</span>(<span style="color: #6c71c4;">str</span>(bottles) + <span style="color: #2aa198;">' green bottles sitting on the wall'</span>)
    <span style="color: #859900;">print</span>(<span style="color: #2aa198;">'And if one green bottle should accidently fall'</span>)
    <span style="color: #6c71c4;">bottles</span> = bottles -1
    <span style="color: #859900;">print</span>(<span style="color: #2aa198;">"There'll be "</span> + <span style="color: #6c71c4;">str</span>(bottles) + <span style="color: #2aa198;">' green bottles, sitting on the wall'</span>)
</pre>
</div>
<ul class="org-ul">
<li>Copy and paste the code into a new script and run it. You can change the bottles variable to anything you like.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3 badge">
<h3 id="sec-3-3">Badge It - Platinum</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>Try and create a script to write out the lyrics of one of the songs listed above.
</li>
<li>Use a variable to keep track of the numbers of Frogs, Buns or Ducks, and a while loop to change them.
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
